renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
/*********************************************************************************************************//**
 * @file    spi_module.c
 * @version $Rev:: 1288         $
 * @date    $Date:: 2024-07-10 #$
 * @brief   The SPI Master (interrupt mode with buffer).
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_board_config.h"
#include "spi_module.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup SPI SPI
  * @{
  */

/** @addtogroup SPI_API SPI API
  * @{
  */
/**
 * @brief SPI API state variables
 */
/* Private constants ---------------------------------------------------------------------------------------*/
#ifdef HTCFG_SPI_CH0
#define _SCK0_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH0_SCK_GPIO_PORT)
#define _SCK0_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH0_SCK_GPIO_PIN)
#define _SEL0_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH0_SEL_GPIO_PORT)
#define _SEL0_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH0_SEL_GPIO_PIN)
#define _MOSI0_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH0_MOSI_GPIO_PORT)
#define _MOSI0_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH0_MOSI_GPIO_PIN)
#define _MISO0_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH0_MISO_GPIO_PORT)
#define _MISO0_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH0_MISO_GPIO_PIN)
#define _SPI_CH0                 STRCAT2(HT_,       HTCFG_SPI_CH0)              /* SPI channel                         */
#define _SPI_INT0                STRCAT2(HTCFG_SPI_CH0, _IRQn)                  /* SPI interrupt channel of NVIC       */
#define _SPI_MISO0               STRCAT2(P,         HTCFG_CH0_MISO_GPIO_PORT)   /* MISO clock enable bit               */
#define _GPIO_MISO0              STRCAT2(HT_GPIO,    HTCFG_CH0_MISO_GPIO_PORT)
#endif

#ifdef HTCFG_SPI_CH1
#define _SCK1_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH1_SCK_GPIO_PORT)
#define _SCK1_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH1_SCK_GPIO_PIN)
#define _SEL1_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH1_SEL_GPIO_PORT)
#define _SEL1_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH1_SEL_GPIO_PIN)
#define _MOSI1_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH1_MOSI_GPIO_PORT)
#define _MOSI1_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH1_MOSI_GPIO_PIN)
#define _MISO1_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH1_MISO_GPIO_PORT)
#define _MISO1_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH1_MISO_GPIO_PIN)
#define _SPI_CH1                 STRCAT2(HT_,       HTCFG_SPI_CH1)              /* SPI channel                         */
#define _SPI_INT1                STRCAT2(HTCFG_SPI_CH1, _IRQn)                  /* SPI interrupt channel of NVIC       */
#define _SPI_MISO1               STRCAT2(P,         HTCFG_CH1_MISO_GPIO_PORT)   /* MISO clock enable bit               */
#define _GPIO_MISO1              STRCAT2(HT_GPIO,    HTCFG_CH1_MISO_GPIO_PORT)
#endif

#ifdef HTCFG_SPI_CH2
#define _SCK2_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH2_SCK_GPIO_PORT)
#define _SCK2_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH2_SCK_GPIO_PIN)
#define _SEL2_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH2_SEL_GPIO_PORT)
#define _SEL2_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH2_SEL_GPIO_PIN)
#define _MOSI2_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH2_MOSI_GPIO_PORT)
#define _MOSI2_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH2_MOSI_GPIO_PIN)
#define _MISO2_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH2_MISO_GPIO_PORT)
#define _MISO2_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH2_MISO_GPIO_PIN)
#define _SPI_CH2                 STRCAT2(HT_,       HTCFG_SPI_CH2)              /* SPI channel                         */
#define _SPI_INT2                STRCAT2(HTCFG_SPI_CH2, _IRQn)                  /* SPI interrupt channel of NVIC       */
#define _SPI_MISO2               STRCAT2(P,         HTCFG_CH2_MISO_GPIO_PORT)   /* MISO clock enable bit               */
#define _GPIO_MISO2              STRCAT2(HT_GPIO,    HTCFG_CH2_MISO_GPIO_PORT)
#endif

#ifdef HTCFG_SPI_CH3
#define _SCK3_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH3_SCK_GPIO_PORT)
#define _SCK3_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH3_SCK_GPIO_PIN)
#define _SEL3_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_CH3_SEL_GPIO_PORT)
#define _SEL3_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_CH3_SEL_GPIO_PIN)
#define _MOSI3_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH3_MOSI_GPIO_PORT)
#define _MOSI3_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH3_MOSI_GPIO_PIN)
#define _MISO3_GPIO_ID           STRCAT2(GPIO_P,    HTCFG_CH3_MISO_GPIO_PORT)
#define _MISO3_AFIO_PIN          STRCAT2(AFIO_PIN_, HTCFG_CH3_MISO_GPIO_PIN)
#define _SPI_CH3                 STRCAT2(HT_,       HTCFG_SPI_CH3)              /* SPI channel                         */
#define _SPI_INT3                STRCAT2(HTCFG_SPI_CH3, _IRQn)                  /* SPI interrupt channel of NVIC       */
#define _SPI_MISO3               STRCAT2(P,         HTCFG_CH3_MISO_GPIO_PORT)   /* MISO clock enable bit               */
#define _GPIO_MISO3              STRCAT2(HT_GPIO,    HTCFG_CH3_MISO_GPIO_PORT)
#endif

/* Private macro -------------------------------------------------------------------------------------------*/
#define __SPI_API_DBG_PRF(...)

#if (SPICFG_DEBUG_MODE)
  #undef __SPI_API_DBG_PRF
  #define __SPI_API_DBG_PRF printf
  #warning "================================ Debug Mode Warning ===================================="
  #warning " Debug mode has been enable which degrade the performance.                              "
  #warning " After all debug operation is finished, please remember to turn off debug mode.         "
  #warning "========================================================================================"
#endif

/* Private types -------------------------------------------------------------------------------------------*/
typedef struct
{
  HT_SPI_TypeDef *pSPIx;
  u8 *puTxBuffer;
  u8 *puRxBuffer;
  bool uIsTxBufferFix;
  bool uIsRxBufferFix;
  u32 uTxLength;
  u32 uRxLength;
  u32 uTxIndex;
  u32 uRxIndex;

  HT_GPIO_TypeDef *pGPIO_MISO;
  u32 uGPIO_MISOId;
  u32 uGPIO_MISOAfioPin;

  u32 uPDMARxCh;
  u32 uPDMATxCh;

  vu32 IsErrorSlaveAbort;
  vu32 IsErrorSlaveRxUnexpectedData;
  vu32 IsBusBusy;
} SPIAPI_StateTypeDef;

/* Private variables ---------------------------------------------------------------------------------------*/
SPIAPI_StateTypeDef gSPIAPIState[SPICFG_SUPPORT_CH];
#if SPICFG_PDMA_MODE
PDMACH_InitTypeDef PDMACH_RxStructure[SPICFG_SUPPORT_CH];
PDMACH_InitTypeDef PDMACH_TxStructure[SPICFG_SUPPORT_CH];
#endif

#if FREERTOS_SPI
SemaphoreHandle_t Semphr[SPICFG_SUPPORT_CH];
StaticSemaphore_t Semphr_Buffer[SPICFG_SUPPORT_CH];
SemaphoreHandle_t Mutex[SPICFG_SUPPORT_CH];
StaticSemaphore_t Mutex_Buffer[SPICFG_SUPPORT_CH];
u32 Transfer_Result[SPICFG_SUPPORT_CH];
void _SPIAPI_ISR_FreeRTOS(u32 CH);
#endif

/* Private function prototypes -----------------------------------------------------------------------------*/
void _SPIAPI_InitAPIParameter(void);
void _SPIAPI_ResetPDMA(u32 CH);
u32  _SPIAPI_IsPDMARxEmpty(u32 CH);
void _SPIAPI_IRQHandler(u32 CH);
bool _SPIAPI_IsRxFinish(u32 CH);
bool _SPIAPI_IsTxFinish(u32 CH);

/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  Initial SPI.
  * @param  CH: SPI Channel
  * @retval None
  ***********************************************************************************************************/
void SPIAPI_Init(u32 CH)
{
  /* !!! NOTICE !!!
     Notice that the local variable (structure) did not have an initial value.
     Please confirm that there are no missing members in the parameter settings below in this function.
  */
  SPI_InitTypeDef SPI_InitStructure;
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
  CKCUClock.Bit.AFIO       = 1;
  #if SPICFG_PDMA_MODE
  #if (__CORTEX_M == 4)
  CKCUClock.Bit.PDMA0      = 1;
  #else
  CKCUClock.Bit.PDMA       = 1;
  #endif
  #endif

