renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
  _SPIAPI_InitAPIParameter();

  SPI_InitStructure.SPI_FIFO = SPI_FIFO_ENABLE;
  SPI_InitStructure.SPI_DataLength = SPI_DATALENGTH_8;
  SPI_InitStructure.SPI_SELMode = SPI_SEL_HARDWARE;
  SPI_InitStructure.SPI_RxFIFOTriggerLevel = 1;
  SPI_InitStructure.SPI_TxFIFOTriggerLevel = 0;

  #ifdef HTCFG_SPI_CH0
  if (CH == SPI_API_CH0)
  {
    /* Enable SPI & AFIO APB clock                                                                          */
    CKCUClock.Bit.HTCFG_SPI_CH0 = 1;
    CKCUClock.Bit._SPI_MISO0 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    /* Configure AFIO as SPI mode                                                                           */
    #if SPICFG_MISOD_IDLE_VALUE
      GPIO_SetOutBits(_GPIO_MISO0, _MISO0_AFIO_PIN);
    #else
      GPIO_ClearOutBits(_GPIO_MISO0, _MISO0_AFIO_PIN);
    #endif
    GPIO_DirectionConfig(_GPIO_MISO0,_MISO0_AFIO_PIN,GPIO_DIR_OUT);
    AFIO_GPxConfig(_MISO0_GPIO_ID, _MISO0_AFIO_PIN, AFIO_FUN_GPIO);

    AFIO_GPxConfig(_SCK0_GPIO_ID,  _SCK0_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_SEL0_GPIO_ID,  _SEL0_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_MOSI0_GPIO_ID, _MOSI0_AFIO_PIN, AFIO_FUN_SPI);

    /* SPI configuration                                                                                      */
    SPI_InitStructure.SPI_Mode = SPICFG_CH0_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH0_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH0_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH0_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH0_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH0_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH0, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH0, ENABLE);
    /* Enable SPI                                                                                             */
    SPI_Cmd(_SPI_CH0, ENABLE);

    #if SPICFG_CH0_PDMA_ENABLE
      /* SPI Master Tx PDMA channel configuration                                                              */
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_SrcAddr = NULL;
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_DstAddr = (u32) &gSPIAPIState[SPI_API_CH0].pSPIx->DR;
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_BlkCnt = 0;
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_BlkLen = 1;
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_DataSize = WIDTH_8BIT;
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_Priority = M_PRIO;
      PDMACH_TxStructure[SPI_API_CH0].PDMACH_AdrMod = SRC_ADR_LIN_INC | DST_ADR_FIX;
      PDMA_Config(SPI_API_CH0_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH0]);

      /* SPI Master Rx PDMA channel configuration                                                              */
      PDMACH_RxStructure[SPI_API_CH0].PDMACH_SrcAddr = (u32) &gSPIAPIState[SPI_API_CH0].pSPIx->DR;
      PDMACH_RxStructure[SPI_API_CH0].PDMACH_DstAddr = NULL;
      PDMACH_RxStructure[SPI_API_CH0].PDMACH_BlkCnt = 0;
      PDMACH_RxStructure[SPI_API_CH0].PDMACH_BlkLen = 1;
      PDMACH_RxStructure[SPI_API_CH0].PDMACH_Priority = VH_PRIO;
      PDMACH_RxStructure[SPI_API_CH0].PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_LIN_INC;
      PDMA_Config(SPI_API_CH0_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH0]);
      /* Enable SPI Tx, Rx GE & TC interrupt                                                                   */
      PDMA_IntConfig(SPI_API_CH0_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TE| PDMA_INT_TC, ENABLE);
      PDMA_IntConfig(SPI_API_CH0_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TE| PDMA_INT_TC, ENABLE);
      NVIC_EnableIRQ(SPI_API_RX_PDMA_INT0);
      NVIC_EnableIRQ(SPI_API_TX_PDMA_INT0);
      SPI_IntConfig(_SPI_CH0,SPI_INT_WC|SPI_INT_RO|SPI_INT_SA, ENABLE);
      NVIC_EnableIRQ(_SPI_INT0);
    #else
      /* Enable SPI interrupts                                                                                  */
      SPI_IntConfig(_SPI_CH0,SPI_INT_RXBNE|SPI_INT_WC|SPI_INT_RO|SPI_INT_SA, ENABLE);
      NVIC_EnableIRQ(_SPI_INT0);
    #endif
  }
  #endif

  #ifdef HTCFG_SPI_CH1
  if (CH == SPI_API_CH1)
  {
    CKCUClock.Bit.HTCFG_SPI_CH1 = 1;
    CKCUClock.Bit._SPI_MISO1 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    #if SPICFG_MISOD_IDLE_VALUE
      GPIO_SetOutBits(_GPIO_MISO1, _MISO1_AFIO_PIN);
    #else
      GPIO_ClearOutBits(_GPIO_MISO1, _MISO1_AFIO_PIN);
    #endif
    GPIO_DirectionConfig(_GPIO_MISO1,_MISO1_AFIO_PIN,GPIO_DIR_OUT);
    AFIO_GPxConfig(_MISO1_GPIO_ID, _MISO1_AFIO_PIN, AFIO_FUN_GPIO);

    AFIO_GPxConfig(_SCK1_GPIO_ID,  _SCK1_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_SEL1_GPIO_ID,  _SEL1_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_MOSI1_GPIO_ID, _MOSI1_AFIO_PIN, AFIO_FUN_SPI);

    SPI_InitStructure.SPI_Mode = SPICFG_CH1_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH1_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH1_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH1_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH1_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH1_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH1, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH1, ENABLE);
    SPI_Cmd(_SPI_CH1, ENABLE);

    #if SPICFG_CH1_PDMA_ENABLE
      /* SPI Master Tx PDMA channel configuration                                                              */
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_SrcAddr = NULL;
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_DstAddr = (u32) &gSPIAPIState[SPI_API_CH1].pSPIx->DR;
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_BlkCnt = 0;
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_BlkLen = 1;
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_DataSize = WIDTH_8BIT;
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_Priority = M_PRIO;
      PDMACH_TxStructure[SPI_API_CH1].PDMACH_AdrMod = SRC_ADR_LIN_INC | DST_ADR_FIX;
      PDMA_Config(SPI_API_CH1_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH1]);

      /* SPI Master Rx PDMA channel configuration                                                              */
      PDMACH_RxStructure[SPI_API_CH1].PDMACH_SrcAddr = (u32) &gSPIAPIState[SPI_API_CH1].pSPIx->DR;
      PDMACH_RxStructure[SPI_API_CH1].PDMACH_DstAddr = NULL;
      PDMACH_RxStructure[SPI_API_CH1].PDMACH_BlkCnt = 0;
      PDMACH_RxStructure[SPI_API_CH1].PDMACH_BlkLen = 1;
      PDMACH_RxStructure[SPI_API_CH1].PDMACH_Priority = VH_PRIO;
      PDMACH_RxStructure[SPI_API_CH1].PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_LIN_INC;
      PDMA_Config(SPI_API_CH1_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH1]);
      /* Enable SPI Tx, Rx GE & TC interrupt                                                                   */
      PDMA_IntConfig(SPI_API_CH1_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
      PDMA_IntConfig(SPI_API_CH1_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
      NVIC_EnableIRQ(SPI_API_RX_PDMA_INT1);
      NVIC_EnableIRQ(SPI_API_TX_PDMA_INT1);
    #else
      /* Enable SPI interrupts                                                                                  */
      SPI_IntConfig(_SPI_CH1,SPI_INT_RXBNE|SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
      NVIC_EnableIRQ(_SPI_INT1);
    #endif
  }
  #endif

