renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
  #ifdef HTCFG_SPI_CH2
  if (CH == SPI_API_CH2)
  {
    CKCUClock.Bit.HTCFG_SPI_CH2 = 1;
    CKCUClock.Bit._SPI_MISO2 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    #if SPICFG_MISOD_IDLE_VALUE
      GPIO_SetOutBits(_GPIO_MISO2, _MISO2_AFIO_PIN);
    #else
      GPIO_ClearOutBits(_GPIO_MISO2, _MISO2_AFIO_PIN);
    #endif
    GPIO_DirectionConfig(_GPIO_MISO2,_MISO2_AFIO_PIN,GPIO_DIR_OUT);
    AFIO_GPxConfig(_MISO2_GPIO_ID, _MISO2_AFIO_PIN, AFIO_FUN_GPIO);

    AFIO_GPxConfig(_SCK2_GPIO_ID,  _SCK2_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_SEL2_GPIO_ID,  _SEL2_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_MOSI2_GPIO_ID, _MOSI2_AFIO_PIN, AFIO_FUN_SPI);

    SPI_InitStructure.SPI_Mode = SPICFG_CH2_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH2_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH2_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH2_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH2_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH1_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH2, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH2, ENABLE);
    SPI_Cmd(_SPI_CH2, ENABLE);

    #if SPICFG_CH2_PDMA_ENABLE
      /* SPI Master Tx PDMA channel configuration                                                              */
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_SrcAddr = NULL;
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_DstAddr = (u32) &gSPIAPIState[SPI_API_CH2].pSPIx->DR;
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_BlkCnt = 0;
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_BlkLen = 1;
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_DataSize = WIDTH_8BIT;
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_Priority = M_PRIO;
      PDMACH_TxStructure[SPI_API_CH2].PDMACH_AdrMod = SRC_ADR_LIN_INC | DST_ADR_FIX;
      PDMA_Config(SPI_API_CH2_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH2]);

      /* SPI Master Rx PDMA channel configuration                                                              */
      PDMACH_RxStructure[SPI_API_CH2].PDMACH_SrcAddr = (u32) &gSPIAPIState[SPI_API_CH2].pSPIx->DR;
      PDMACH_RxStructure[SPI_API_CH2].PDMACH_DstAddr = NULL;
      PDMACH_RxStructure[SPI_API_CH2].PDMACH_BlkCnt = 0;
      PDMACH_RxStructure[SPI_API_CH2].PDMACH_BlkLen = 1;
      PDMACH_RxStructure[SPI_API_CH2].PDMACH_Priority = VH_PRIO;
      PDMACH_RxStructure[SPI_API_CH2].PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_LIN_INC;
      PDMA_Config(SPI_API_CH2_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH2]);
      /* Enable SPI Tx, Rx GE & TC interrupt                                                                   */
      PDMA_IntConfig(SPI_API_CH2_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
      PDMA_IntConfig(SPI_API_CH2_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
      NVIC_EnableIRQ(SPI_API_RX_PDMA_INT2);
      NVIC_EnableIRQ(SPI_API_TX_PDMA_INT2);
    #else
      /* Enable SPI interrupts                                                                                  */
      SPI_IntConfig(_SPI_CH2,SPI_INT_RXBNE|SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
      NVIC_EnableIRQ(_SPI_INT2);
    #endif
  }
  #endif

  #ifdef HTCFG_SPI_CH3
  if (CH == SPI_API_CH3)
  {
    CKCUClock.Bit.HTCFG_SPI_CH3 = 1;
    CKCUClock.Bit._SPI_MISO3 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    #if SPICFG_MISOD_IDLE_VALUE
      GPIO_SetOutBits(_GPIO_MISO3, _MISO3_AFIO_PIN);
    #else
      GPIO_ClearOutBits(_GPIO_MISO3, _MISO3_AFIO_PIN);
    #endif
    GPIO_DirectionConfig(_GPIO_MISO3,_MISO3_AFIO_PIN,GPIO_DIR_OUT);
    AFIO_GPxConfig(_MISO3_GPIO_ID, _MISO3_AFIO_PIN, AFIO_FUN_GPIO);

    AFIO_GPxConfig(_SCK3_GPIO_ID,  _SCK3_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_SEL3_GPIO_ID,  _SEL3_AFIO_PIN,  AFIO_FUN_SPI);
    AFIO_GPxConfig(_MOSI3_GPIO_ID, _MOSI3_AFIO_PIN, AFIO_FUN_SPI);

    SPI_InitStructure.SPI_Mode = SPICFG_CH3_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH3_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH3_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH3_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH3_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH3_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH3, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH3, ENABLE);
    SPI_Cmd(_SPI_CH3, ENABLE);

    #if SPICFG_CH3_PDMA_ENABLE
      /* SPI Master Tx PDMA channel configuration                                                              */
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_SrcAddr = NULL;
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_DstAddr = (u32) &gSPIAPIState[SPI_API_CH3].pSPIx->DR;
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_BlkCnt = 0;
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_BlkLen = 1;
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_DataSize = WIDTH_8BIT;
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_Priority = M_PRIO;
      PDMACH_TxStructure[SPI_API_CH3].PDMACH_AdrMod = SRC_ADR_LIN_INC | DST_ADR_FIX;
      PDMA_Config(SPI_API_CH3_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH3]);

      /* SPI Master Rx PDMA channel configuration                                                              */
      PDMACH_RxStructure[SPI_API_CH3].PDMACH_SrcAddr = (u32) &gSPIAPIState[SPI_API_CH3].pSPIx->DR;
      PDMACH_RxStructure[SPI_API_CH3].PDMACH_DstAddr = NULL;
      PDMACH_RxStructure[SPI_API_CH3].PDMACH_BlkCnt = 0;
      PDMACH_RxStructure[SPI_API_CH3].PDMACH_BlkLen = 1;
      PDMACH_RxStructure[SPI_API_CH3].PDMACH_Priority = VH_PRIO;
      PDMACH_RxStructure[SPI_API_CH3].PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_LIN_INC;
      PDMA_Config(SPI_API_CH3_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH3]);
      /* Enable SPI Tx, Rx GE & TC interrupt                                                                   */
      PDMA_IntConfig(SPI_API_CH3_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
      PDMA_IntConfig(SPI_API_CH3_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
      NVIC_EnableIRQ(SPI_API_RX_PDMA_INT3);
      NVIC_EnableIRQ(SPI_API_TX_PDMA_INT3);
    #else
      /* Enable SPI interrupts                                                                                  */
      SPI_IntConfig(_SPI_CH3,SPI_INT_RXBNE|SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
      NVIC_EnableIRQ(_SPI_INT3);
    #endif
  }
  #endif
}

#if SPICFG_PDMA_MODE
/*********************************************************************************************************//**
  * @brief  Reset PDMA.
  * @retval None
  ***********************************************************************************************************/
void _SPIAPI_ResetPDMA(u32 CH)
{
  /* !!! NOTICE !!!
     Notice that the local variable (structure) did not have an initial value.
     Please confirm that there are no missing members in the parameter settings below in this function.
  */
  SPI_InitTypeDef SPI_InitStructure;

  /* Reset PDMA, SPI */
  RSTCU_PeripReset_TypeDef Reset = {0x00};
  #if (__CORTEX_M == 4)
  Reset.Bit.PDMA0  = 1;
  #else
  Reset.Bit.PDMA   = 1;
  #endif
  if(CH == SPI_API_CH0)
  {
    #ifdef HTCFG_SPI_CH0
    Reset.Bit.HTCFG_SPI_CH0 = 1;
    #endif
  }

  if (CH == SPI_API_CH1)
  {
    #ifdef HTCFG_SPI_CH1
    Reset.Bit.HTCFG_SPI_CH1 = 1;
    #endif
  }

  if (CH == SPI_API_CH2)
  {
    #ifdef HTCFG_SPI_CH2
    Reset.Bit.HTCFG_SPI_CH2 = 1;
    #endif
  }

  if (CH == SPI_API_CH3)
  {
    #ifdef HTCFG_SPI_CH3
    Reset.Bit.HTCFG_SPI_CH3 = 1;
    #endif
  }
  RSTCU_PeripReset(Reset, ENABLE);

  /* Re-Inital SPI,PDMA */
  SPI_InitStructure.SPI_FIFO = SPI_FIFO_ENABLE;
  SPI_InitStructure.SPI_DataLength = SPI_DATALENGTH_8;
  SPI_InitStructure.SPI_SELMode = SPI_SEL_HARDWARE;
  SPI_InitStructure.SPI_RxFIFOTriggerLevel = 1;
  SPI_InitStructure.SPI_TxFIFOTriggerLevel = 0;

