renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
  #ifdef HTCFG_SPI_CH0
  if(CH == SPI_API_CH0)
  {
    SPI_InitStructure.SPI_Mode = SPICFG_CH0_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH0_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH0_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH0_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH0_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH0_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH0, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH0, ENABLE);
    SPI_Cmd(_SPI_CH0, ENABLE);
  }
  #if SPICFG_CH0_PDMA_ENABLE
  PDMA_Config(SPI_API_CH0_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH0]);
  PDMA_Config(SPI_API_CH0_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH0]);
  PDMA_IntConfig(SPI_API_CH0_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  PDMA_IntConfig(SPI_API_CH0_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  NVIC_EnableIRQ(SPI_API_RX_PDMA_INT0);
  NVIC_EnableIRQ(SPI_API_TX_PDMA_INT0);
  SPI_IntConfig(_SPI_CH0,SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
  NVIC_EnableIRQ(_SPI_INT0);
  #endif
  #endif

  #ifdef HTCFG_SPI_CH1
  if(CH == SPI_API_CH1)
  {
    SPI_InitStructure.SPI_Mode = SPICFG_CH1_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH1_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH1_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH1_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH1_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH1_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH1, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH1, ENABLE);
    SPI_Cmd(_SPI_CH1, ENABLE);
  }
  #if SPICFG_CH1_PDMA_ENABLE
  PDMA_Config(SPI_API_CH1_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH1]);
  PDMA_Config(SPI_API_CH1_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH1]);
  PDMA_IntConfig(SPI_API_CH1_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  PDMA_IntConfig(SPI_API_CH1_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  NVIC_EnableIRQ(SPI_API_RX_PDMA_INT1);
  NVIC_EnableIRQ(SPI_API_TX_PDMA_INT1);
  SPI_IntConfig(_SPI_CH1,SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
  NVIC_EnableIRQ(_SPI_INT1);
  #endif
  #endif

  #ifdef HTCFG_SPI_CH2
  if(CH == SPI_API_CH2)
  {
    SPI_InitStructure.SPI_Mode = SPICFG_CH2_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH2_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH2_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH2_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH2_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH2_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH2, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH2, ENABLE);
    SPI_Cmd(_SPI_CH2, ENABLE);
  }
  #if SPICFG_CH2_PDMA_ENABLE
  PDMA_Config(SPI_API_CH2_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH2]);
  PDMA_Config(SPI_API_CH2_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH2]);
  PDMA_IntConfig(SPI_API_CH2_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  PDMA_IntConfig(SPI_API_CH2_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  NVIC_EnableIRQ(SPI_API_RX_PDMA_INT2);
  NVIC_EnableIRQ(SPI_API_TX_PDMA_INT2);
  SPI_IntConfig(_SPI_CH2,SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
  NVIC_EnableIRQ(_SPI_INT2);
  #endif
  #endif

  #ifdef HTCFG_SPI_CH3
  if(CH == SPI_API_CH3)
  {
    SPI_InitStructure.SPI_Mode = SPICFG_CH3_MODE<<14;
    SPI_InitStructure.SPI_SELPolarity = SPICFG_CH3_SEL_POLARITY<<11;
    SPI_InitStructure.SPI_FirstBit = SPICFG_CH3_FIRST_BIT<<12;
    SPI_InitStructure.SPI_CPOL = SPICFG_CH3_CPOL<<10;
    SPI_InitStructure.SPI_CPHA = SPICFG_CH3_CPHA;
    SPI_InitStructure.SPI_ClockPrescaler = SPICFG_CH3_CLOCK_PRESCALER;
    SPI_Init(_SPI_CH3, &SPI_InitStructure);
    SPI_SELOutputCmd(_SPI_CH3, ENABLE);
    SPI_Cmd(_SPI_CH3, ENABLE);
  }
  #if SPICFG_CH3_PDMA_ENABLE
  PDMA_Config(SPI_API_CH3_TX_PDMA_CHANNEL, &PDMACH_TxStructure[SPI_API_CH3]);
  PDMA_Config(SPI_API_CH3_RX_PDMA_CHANNEL, &PDMACH_RxStructure[SPI_API_CH3]);
  PDMA_IntConfig(SPI_API_CH3_RX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  PDMA_IntConfig(SPI_API_CH3_TX_PDMA_CHANNEL, PDMA_INT_GE | PDMA_INT_TC, ENABLE);
  NVIC_EnableIRQ(SPI_API_RX_PDMA_INT3);
  NVIC_EnableIRQ(SPI_API_TX_PDMA_INT3);
  SPI_IntConfig(_SPI_CH3,SPI_INT_WC|SPI_INT_RO|SPI_INT_MF|SPI_INT_SA, ENABLE);
  NVIC_EnableIRQ(_SPI_INT3);
  #endif
  #endif
}
#endif

/*********************************************************************************************************//**
  * @brief  SPI Write\Read.
  * @param  CH: SPI Channel
  * @param  pSPIAPI:
  * @retval None
  ***********************************************************************************************************/
bool SPIAPI_WriteRead(u32 CH, SPIAPI_BufferTypeDef *pSPIAPIBuffer)
{
  SPIAPI_StateTypeDef *pSPIAPIState   = &gSPIAPIState[CH];
  if((pSPIAPIState->IsErrorSlaveAbort == TRUE) || (pSPIAPIState->IsErrorSlaveRxUnexpectedData == TRUE))
  {
    return FALSE;
  }
  #if SPICFG_PDMA_MODE
  {
    PDMACH_InitTypeDef *pDMATxState   = &PDMACH_TxStructure[CH];
    PDMACH_InitTypeDef *pDMARxState   = &PDMACH_RxStructure[CH];

    AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_SPI);

    PDMA_EnaCmd(SPI_MODULE_PDMA_RX_CH, DISABLE);
    PDMA_EnaCmd(SPI_MODULE_PDMA_TX_CH, DISABLE);
    SPI_PDMACmd(pSPIAPIState->pSPIx, SPI_PDMAREQ_TX | SPI_PDMAREQ_RX, DISABLE);
    while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_RXBNE))
    {
      pSPIAPIState->IsErrorSlaveRxUnexpectedData =TRUE;
      return FALSE;
    }

    /* SPI Rx PDMA channel configuration                                                               */
    pDMARxState->PDMACH_DstAddr = (u32) pSPIAPIBuffer->puRxBuffer;
    pSPIAPIState->uRxLength = pSPIAPIBuffer->uTxRxLength;
    pDMARxState->PDMACH_BlkCnt = pSPIAPIBuffer->uTxRxLength;
    if (pSPIAPIBuffer->uIsRxBufferFix == TRUE)
    {
      pDMARxState->PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_FIX;
    }
    else
    {
      pDMARxState->PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_LIN_INC;
    }
    PDMA_Config(SPI_MODULE_PDMA_RX_CH, pDMARxState);
    /* Enable the corresponding PDMA channel                                                            */
    PDMA_EnaCmd(SPI_MODULE_PDMA_RX_CH, ENABLE);
    if(_SPIAPI_IsPDMARxEmpty(CH)==FALSE)
    {
      /* Rx buffer isn't empty.                                                                        */
      __SPI_API_DBG_PRF("Rx FIFO isn't empty.\r\n");
      #if 1
      /* An error occurred while transferring data.                                                    */
      while(1);
      #else
      /* Reset PDMA and SPI in slave mode.                                                             */
      _SPIAPI_ResetPDMA(CH);
      PDMA_Config(SPI_MODULE_PDMA_RX_CH, pDMARxState);
      PDMA_EnaCmd(SPI_MODULE_PDMA_RX_CH, ENABLE);
      #endif
    }

    /* SPI Tx PDMA channel configuration                                                               */
    pDMATxState->PDMACH_SrcAddr = (u32) pSPIAPIBuffer->puTxBuffer;
    pDMATxState->PDMACH_BlkCnt = pSPIAPIBuffer->uTxRxLength;
    pSPIAPIState->uTxLength = pSPIAPIBuffer->uTxRxLength;
    if (pSPIAPIBuffer->uIsTxBufferFix == TRUE)
    {
      pDMATxState->PDMACH_AdrMod = SRC_ADR_FIX | DST_ADR_FIX;
    }
    else
    {
      pDMATxState->PDMACH_AdrMod = SRC_ADR_LIN_INC | DST_ADR_FIX;
    }
    PDMA_Config(SPI_MODULE_PDMA_TX_CH, pDMATxState);

    /* Enable the corresponding PDMA channel                                                            */
    PDMA_EnaCmd(SPI_MODULE_PDMA_TX_CH, ENABLE);
    /* Enable master SPI0 PDMA requests later                                                           */
    SPI_PDMACmd(pSPIAPIState->pSPIx, SPI_PDMAREQ_TX | SPI_PDMAREQ_RX, ENABLE);
  }
  #else
    pSPIAPIState->puRxBuffer       = pSPIAPIBuffer->puRxBuffer;
    pSPIAPIState->puTxBuffer       = pSPIAPIBuffer->puTxBuffer;
    pSPIAPIState->uRxLength        = pSPIAPIBuffer->uTxRxLength;
    pSPIAPIState->uTxLength        = pSPIAPIBuffer->uTxRxLength;
    pSPIAPIState->uTxIndex              = 0;
    pSPIAPIState->uRxIndex              = 0;
    pSPIAPIState->IsErrorSlaveAbort     = FALSE;
    pSPIAPIState->IsErrorSlaveRxUnexpectedData    = FALSE;
    AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_SPI);
    SPI_IntConfig(pSPIAPIState->pSPIx, SPI_INT_TXBE, ENABLE);
  #endif
  return TRUE;
}

#if SPICFG_PDMA_MODE
/*********************************************************************************************************//**
  * @brief  Check if PDMA Rx is empty.
  * @param  CH: SPI Channel
  * @retval Result: TRUE or FALSE
  ***********************************************************************************************************/
u32 _SPIAPI_IsPDMARxEmpty(u32 CH)
{
  HT_PDMACH_TypeDef *PDMACH;
  switch(CH)
  {
    #ifdef HTCFG_SPI_CH0
    case SPI_API_CH0:
    {
      #if SPICFG_CH0_PDMA_ENABLE
      PDMACH = SPI_API_CH0_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH1
    case SPI_API_CH1:
    {
      #if SPICFG_CH1_PDMA_ENABLE
      PDMACH = SPI_API_CH1_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH2
    case SPI_API_CH2:
    {
      #if SPICFG_CH2_PDMA_ENABLE
      PDMACH = SPI_API_CH2_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH3
    case SPI_API_CH3:
    {
      #if SPICFG_CH3_PDMA_ENABLE
      PDMACH = SPI_API_CH3_RX_PDMA;
      #endif
      break;
    }
    #endif
  }
  if(PDMACH->TSR>>16!=PDMACH->CTSR>>16)
  {
    return FALSE;
  }
  else
  {
    return TRUE;
  }
}
#endif

