renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
/*********************************************************************************************************//**
  * @brief  Get write index.
  * @retval None
  ***********************************************************************************************************/
u32 SPIAPI_GetWriteBufferIndex(u32 CH)
{
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[CH];
  #if SPICFG_PDMA_MODE
  HT_PDMACH_TypeDef *PDMACH;
  switch(CH)
  {
    #ifdef HTCFG_SPI_CH0
    case SPI_API_CH0:
    {
      #if SPICFG_CH0_PDMA_ENABLE
      PDMACH = SPI_API_CH0_TX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH1
    case SPI_API_CH1:
    {
      #if SPICFG_CH1_PDMA_ENABLE
      PDMACH = SPI_API_CH1_TX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH2
    case SPI_API_CH2:
    {
      #if SPICFG_CH2_PDMA_ENABLE
      PDMACH = SPI_API_CH2_TX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH3
    case SPI_API_CH3:
    {
      #if SPICFG_CH3_PDMA_ENABLE
      PDMACH = SPI_API_CH3_TX_PDMA;
      #endif
      break;
    }
    #endif
  }
  return pSPIAPIState->uTxLength - (PDMACH->CTSR>>16);
  #else
  return pSPIAPIState->uTxIndex;
  #endif
}

/*********************************************************************************************************//**
  * @brief  Get read index.
  * @param  CH: SPI Channel
  * @retval None
  ***********************************************************************************************************/
u32 SPIAPI_GetReadBufferIndex(u32 CH)
{
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[CH];
  #if SPICFG_PDMA_MODE
  HT_PDMACH_TypeDef *PDMACH;
  switch(CH)
  {
    #ifdef HTCFG_SPI_CH0
    case SPI_API_CH0:
    {
      #if SPICFG_CH0_PDMA_ENABLE
      PDMACH = SPI_API_CH0_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH1
    case SPI_API_CH1:
    {
      #if SPICFG_CH1_PDMA_ENABLE
      PDMACH = SPI_API_CH1_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH2
    case SPI_API_CH2:
    {
      #if SPICFG_CH2_PDMA_ENABLE
      PDMACH = SPI_API_CH2_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH3
    case SPI_API_CH3:
    {
      #if SPICFG_CH3_PDMA_ENABLE
      PDMACH = SPI_API_CH3_RX_PDMA;
      #endif
      break;
    }
    #endif
  }
  return pSPIAPIState->uRxLength - (PDMACH->CTSR>>16);
  #else
  return pSPIAPIState->uRxIndex;
  #endif
}

/*********************************************************************************************************//**
  * @brief  Get SPI buffer statue.
  * @retval Result: SPI_API_FINISH or SPI_API_TIMEOUT
  ***********************************************************************************************************/
SPIAPI_Status_Enum SPIAPI_GetStatus(u32 CH)
{
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[CH];
  SPIAPI_Status_Enum Result =  SPI_API_BUSBUSY;

  if(_SPIAPI_IsRxFinish(CH) && _SPIAPI_IsTxFinish(CH))
  {
    Result = SPI_API_FINISH;
  }

  if(pSPIAPIState->IsErrorSlaveAbort == TRUE)
  {
    Result = SPI_API_SLAVE_ABORT;
    __SPI_API_DBG_PRF("SLAVE_ABORT\r\n");
  }

  if(pSPIAPIState->IsErrorSlaveRxUnexpectedData == TRUE)
  {
    Result = SPI_API_SLAVE_RX_UNEXPECTED_DATA;
    __SPI_API_DBG_PRF("SLAVE_RX_BUFFER_NOT_EMPTY\r\n");
  }
  return Result;
}

/*********************************************************************************************************//**
  * @brief  Clear SPI buffer statue.
  * @retval Result: None
  ***********************************************************************************************************/
void SPIAPI_ClearStatus(u32 CH)
{
  SPIAPI_StateTypeDef *pSPIAPIState   = &gSPIAPIState[CH];
  pSPIAPIState->IsErrorSlaveAbort     = FALSE;
  if(pSPIAPIState->IsErrorSlaveRxUnexpectedData == TRUE)
  {
    while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_RXBNE))
    {
      pSPIAPIState->pSPIx->DR;
    }
    pSPIAPIState->IsErrorSlaveRxUnexpectedData    = FALSE;
  }
}

#if defined(SPI0_IRQ_HANDLER) || defined(SPI1_IRQ_HANDLER) || defined(SPI2_IRQ_HANDLER) || defined(QSPI_IRQ_HANDLER)
#if defined(HT_SPI0) && defined(SPI0_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI0_IRQHandler(void)
{
  SPI0_IRQ_HANDLER();
}
#endif
#if defined(HT_SPI1) && defined(SPI1_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI1_IRQHandler(void)
{
  SPI1_IRQ_HANDLER();
}
#endif
#if defined(HT_SPI2) && defined(SPI2_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI2_IRQHandler(void)
{
  SPI2_IRQ_HANDLER();
}
#endif
#if defined(HT_QSPI) && defined(QSPI_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void QSPI_IRQHandler(void)
{
  QSPI_IRQ_HANDLER();
}
#endif
#else
#ifdef HTCFG_SPI_CH0
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI_API_CH0_IRQHandler(void)
{
  _SPIAPI_IRQHandler(SPI_API_CH0);
}
#endif

#ifdef HTCFG_SPI_CH1
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI_API_CH1_IRQHandler(void)
{
  _SPIAPI_IRQHandler(SPI_API_CH1);
}
#endif

