renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
#ifdef HTCFG_SPI_CH2
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI_API_CH2_IRQHandler(void)
{
  _SPIAPI_IRQHandler(SPI_API_CH2);
}
#endif

#ifdef HTCFG_SPI_CH3
/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void SPI_API_CH3_IRQHandler(void)
{
  _SPIAPI_IRQHandler(SPI_API_CH3);
}
#endif
#endif

/*********************************************************************************************************//**
 * @brief   This function handles SPI interrupt.
 * @retval  None
 ************************************************************************************************************/
void _SPIAPI_IRQHandler(u32 CH)
{
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[CH];
#if SPICFG_PDMA_MODE == 0
  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if((SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXBE) == SET) && ((pSPIAPIState->pSPIx->IER&SPI_INT_TXBE)!=0))
  {
    if((pSPIAPIState->uTxLength <= 0)&&((pSPIAPIState->pSPIx->SR&0x03)==0x03))
    {
      SPI_IntConfig(pSPIAPIState->pSPIx, SPI_INT_TXBE, DISABLE);
      if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
      {
        /* Set MISO Idle value in slave mode */
        AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
        #if SPICFG_MISOD_IDLE_VALUE
        GPIO_SetOutBits(pSPIAPIState->pGPIO_MISO, pSPIAPIState->uGPIO_MISOAfioPin);
        #else
        GPIO_ClearOutBits(pSPIAPIState->pGPIO_MISO, pSPIAPIState->uGPIO_MISOAfioPin);
        #endif
        GPIO_DirectionConfig(pSPIAPIState->pGPIO_MISO,pSPIAPIState->uGPIO_MISOAfioPin,GPIO_DIR_OUT);
      }
    }
    else
    {
      int i;
      u32 uRemainTx=pSPIAPIState->uTxLength;
      if(uRemainTx>=8)
      {
        for(i=0;i<8;i++)
        {
          SPI_SendData(pSPIAPIState->pSPIx,pSPIAPIState->puTxBuffer[pSPIAPIState->uTxIndex++]);
        }
        pSPIAPIState->uTxLength-=8;
      }
      else
      {
        for(i=0;i<uRemainTx;i++)
        {
          SPI_SendData(pSPIAPIState->pSPIx, pSPIAPIState->puTxBuffer[pSPIAPIState->uTxIndex++]);
          pSPIAPIState->uTxLength--;
        }
      }
    }
  }

  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_RXBNE) == SET)
  {
    while(SPI_GetFIFOStatus(pSPIAPIState->pSPIx,SPI_FIFO_RX))
    {
      #if (SPICFG_DEBUG_MODE)
      if (Buffer_isFull(&gSPIRx[CH]))
      {
        /*------------------------------------------------------------------------------------------------*/
        /* Should not reach here! It means the buffer for SPI is full.                                    */
        /*------------------------------------------------------------------------------------------------*/
        __SPI_API_DBG_PRF("SPI Rx Buffer Full!\n\r");
        while (1);
      }
      #endif
      if(pSPIAPIState->uRxIndex < pSPIAPIState->uRxLength)
      {
        pSPIAPIState->puRxBuffer[pSPIAPIState->uRxIndex++]=SPI_ReceiveData(pSPIAPIState->pSPIx);
      }
      else
      {
        pSPIAPIState->IsErrorSlaveRxUnexpectedData = TRUE;
        SPI_ReceiveData(pSPIAPIState->pSPIx);
      }
    }
  }
#endif
  /*-----------------------------SPI Bus Error detection---------------------------------------------------*/
  if(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_RO) == SET)
  {
    SPI_ClearFlag(pSPIAPIState->pSPIx,SPI_FLAG_RO);
  }
  if(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_MF) == SET)
  {
    SPI_ClearFlag(pSPIAPIState->pSPIx,SPI_FLAG_MF);
  }
  if(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_SA) == SET)
  {
    pSPIAPIState->IsErrorSlaveAbort = TRUE;
    SPI_ClearFlag(pSPIAPIState->pSPIx,SPI_FLAG_SA);
  }

  #if FREERTOS_SPI
  _SPIAPI_ISR_FreeRTOS(CH);
  #endif
}

#if SPICFG_PDMA_MODE
/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH0 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH0_IRQHandler(void)
{
  #if SPICFG_CH0_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[0];
  #elif SPICFG_CH1_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[1];
  #elif SPICFG_CH2_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[2];
  #elif SPICFG_CH3_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[3];
  #else
  SPIAPI_StateTypeDef *pSPIAPIState ={0};
  #endif
  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH0,PDMA_FLAG_TC))
  {
    /* Channel 0 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH0, PDMA_FLAG_TC);
    /* Set MISO_IDLE_VALUE in slave mode */
    if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
    {
      /* Wait for Tx Complete, Clear this flags  */
      while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXE)!=SET);

      /* Set MISO Idle value in slave mode */
      AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
    }
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH0,PDMA_FLAG_TE))
  {
    /* Channel 0 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH0, PDMA_FLAG_TE);
  }
}

/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH1 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH1_IRQHandler(void)
{
  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH1,PDMA_FLAG_TC))
  {
    /* Channel 1 Transfer Complete, Clear this flags  */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH1, PDMA_FLAG_TC);
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH1,PDMA_FLAG_TE))
  {
    /* Channel 1 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH1, PDMA_FLAG_TE);
  }
}

