renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH2 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH2_IRQHandler(void)
{
  #if SPICFG_CH0_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[0];
  #elif SPICFG_CH1_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[1];
  #elif SPICFG_CH2_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[2];
  #elif SPICFG_CH3_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[3];
  #else
  SPIAPI_StateTypeDef *pSPIAPIState ={0};
  #endif
  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH2,PDMA_FLAG_TC))
  {
    /* Channel 2 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH2, PDMA_FLAG_TC);
    /* Set MISO idle value in slave mode */
    if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
    {
      /* Wait for Tx Complete */
      while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXE)!=SET);

      /* Set MISO_IDLE_VALUE in slave mode */
      AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
    }
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH2,PDMA_FLAG_TE))
  {
    /* Channel 2 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH2, PDMA_FLAG_TE);
  }
}

/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH3 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH3_IRQHandler(void)
{
  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH3,PDMA_FLAG_TC))
  {
    /* Channel 3 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH3, PDMA_FLAG_TC);
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH3,PDMA_FLAG_TE))
  {
    /* Channel 3 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH3, PDMA_FLAG_TE);
  }
}

/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH4 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH4_IRQHandler(void)
{
  #if SPICFG_CH0_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[0];
  #elif SPICFG_CH1_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[1];
  #elif SPICFG_CH2_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[2];
  #elif SPICFG_CH3_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[3];
  #else
  SPIAPI_StateTypeDef *pSPIAPIState ={0};
  #endif
  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH4,PDMA_FLAG_TC))
  {
    /* Channel 4 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH4, PDMA_FLAG_TC);
    /* Set MISO idle value in slave mode */
    if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
    {
      /* Wait for Tx Complete */
      while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXE)!=SET);

      /* Set MISO_IDLE_VALUE in slave mode */
      AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
    }
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH4,PDMA_FLAG_TE))
  {
    /* Channel 4 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH4, PDMA_FLAG_TE);
  }
}

/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH5 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH5_IRQHandler(void)
{
  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH5,PDMA_FLAG_TC))
  {
    /* Channel 5 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH5, PDMA_FLAG_TC);
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH5,PDMA_FLAG_TE))
  {
    /* Channel 5 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH5, PDMA_FLAG_TE);
  }
}

/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH0~CH1 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH0_1_IRQHandler(void)
{
  #if SPICFG_CH0_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[0];
  #elif SPICFG_CH1_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[1];
  #elif SPICFG_CH2_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[2];
  #elif SPICFG_CH3_PDMA == 0
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[3];
  #else
  SPIAPI_StateTypeDef *pSPIAPIState ={0};
  #endif
  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH0,PDMA_FLAG_TC))
  {
    /* Channel 0 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH0, PDMA_FLAG_TC);
    /* Set MISO_IDLE_VALUE in slave mode */
    if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
    {
      /* Wait for Tx Complete, Clear this flags  */
      while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXE)!=SET);

      /* Set MISO Idle value in slave mode */
      AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
    }
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH0,PDMA_FLAG_TE))
  {
    /* Channel 0 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH0, PDMA_FLAG_TE);
  }

  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH1,PDMA_FLAG_TC))
  {
    /* Channel 1 Transfer Complete, Clear this flags  */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH1, PDMA_FLAG_TC);
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH1,PDMA_FLAG_TE))
  {
    /* Channel 1 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH1, PDMA_FLAG_TE);
  }
}

