renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
/*********************************************************************************************************//**
 * @brief   This function handles PDMA CH2~CH5 interrupt.
 * @retval  None
 ************************************************************************************************************/
void PDMA_CH2_5_IRQHandler(void)
{
  #if SPICFG_CH0_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[0];
  #elif SPICFG_CH1_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[1];
  #elif SPICFG_CH2_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[2];
  #elif SPICFG_CH3_PDMA == 1
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[3];
  #else
  SPIAPI_StateTypeDef *pSPIAPIState ={0};
  #endif
  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH2,PDMA_FLAG_TC))
  {
    /* Channel 4 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH2, PDMA_FLAG_TC);
    /* Set MISO idle value in slave mode */
    if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
    {
      /* Wait for Tx Complete */
      while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXE)!=SET);

      /* Set MISO_IDLE_VALUE in slave mode */
      AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
    }
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH2,PDMA_FLAG_TE))
  {
    /* Channel 4 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH2, PDMA_FLAG_TE);
  }

  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH3,PDMA_FLAG_TC))
  {
    /* Channel 5 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH3, PDMA_FLAG_TC);
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH3,PDMA_FLAG_TE))
  {
    /* Channel 5 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH3, PDMA_FLAG_TE);
  }

  /*-----------------------------SPI Receiver -----------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH4,PDMA_FLAG_TC))
  {
    /* Channel 4 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH4, PDMA_FLAG_TC);
    /* Set MISO idle value in slave mode */
    if((pSPIAPIState->pSPIx->CR1&SPI_MASTER) == 0)
    {
      /* Wait for Tx Complete */
      while(SPI_GetFlagStatus(pSPIAPIState->pSPIx,SPI_FLAG_TXE)!=SET);

      /* Set MISO_IDLE_VALUE in slave mode */
      AFIO_GPxConfig(pSPIAPIState->uGPIO_MISOId, pSPIAPIState->uGPIO_MISOAfioPin, AFIO_FUN_GPIO);
    }
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH4,PDMA_FLAG_TE))
  {
    /* Channel 4 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH4, PDMA_FLAG_TE);
  }

  /*----------------------------- SPI Transmitter ------------------------------------------------------*/
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH5,PDMA_FLAG_TC))
  {
    /* Channel 5 Transfer Complete, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH5, PDMA_FLAG_TC);
  }
  if(PDMA_GetFlagStatus(SPI_MODULE_PDMA_CH5,PDMA_FLAG_TE))
  {
    /* Channel 5 Transfer Error, Clear this flags */
    PDMA_ClearFlag(SPI_MODULE_PDMA_CH5, PDMA_FLAG_TE);
  }
}
#endif

/*********************************************************************************************************//**
  * @brief  Did SPI device receive data finish?
  * @retval Result: TRUE or False
  ***********************************************************************************************************/
bool _SPIAPI_IsRxFinish(u32 CH)
{
  #if SPICFG_PDMA_MODE
  HT_PDMACH_TypeDef *PDMACH;
  switch(CH)
  {
    #ifdef HTCFG_SPI_CH0
    case SPI_API_CH0:
    {
      #if SPICFG_CH0_PDMA_ENABLE
      PDMACH = SPI_API_CH0_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH1
    case SPI_API_CH1:
    {
      #if SPICFG_CH1_PDMA_ENABLE
      PDMACH = SPI_API_CH1_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH2
    case SPI_API_CH2:
    {
      #if SPICFG_CH2_PDMA_ENABLE
      PDMACH = SPI_API_CH2_RX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH3
    case SPI_API_CH3:
    {
      #if SPICFG_CH3_PDMA_ENABLE
      PDMACH = SPI_API_CH3_RX_PDMA;
      #endif
      break;
    }
    #endif
  }
  if((PDMACH->CTSR>>16) == 0)
  {
    return TRUE;
  }
  #else
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[CH];
  if(pSPIAPIState->uRxIndex == pSPIAPIState->uRxLength)
  {
    return TRUE;
  }
  #endif
  return FALSE;
}

/*********************************************************************************************************//**
  * @brief  Was SPI device transmit data finish?
  * @retval Result: TRUE or False
  ***********************************************************************************************************/
bool _SPIAPI_IsTxFinish(u32 CH)
{
  #if SPICFG_PDMA_MODE
  HT_PDMACH_TypeDef *PDMACH;
  switch(CH)
  {
    #ifdef HTCFG_SPI_CH0
    case SPI_API_CH0:
    {
      #if SPICFG_CH0_PDMA_ENABLE
      PDMACH = SPI_API_CH0_TX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH1
    case SPI_API_CH1:
    {
      #if SPICFG_CH1_PDMA_ENABLE
      PDMACH = SPI_API_CH1_TX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH2
    case SPI_API_CH2:
    {
      #if SPICFG_CH2_PDMA_ENABLE
      PDMACH = SPI_API_CH2_TX_PDMA;
      #endif
      break;
    }
    #endif
    #ifdef HTCFG_SPI_CH3
    case SPI_API_CH3:
    {
      #if SPICFG_CH3_PDMA_ENABLE
      PDMACH = SPI_API_CH3_TX_PDMA;
      #endif
      break;
    }
    #endif
  }
  if(0 == (PDMACH->CTSR>>16))
  {
    return TRUE;
  }
  #else
  SPIAPI_StateTypeDef *pSPIAPIState = &gSPIAPIState[CH];
  if(0 == pSPIAPIState->uTxLength)
  {
    return TRUE;
  }
  #endif
  return FALSE;
}

/* Private functions ---------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
 * @brief  Initial SPI_API Parameter.
 * @retval  None
 ************************************************************************************************************/
#if SPICFG_PDMA_MODE
#if (__CORTEX_M == 4)
void _SPIAPI_SetPDMAChannelPara(HT_PDMA_TypeDef* PDMAx, u32 PDMA_CHn , u32* Para)
{
  *Para = PDMA_CHn;
}
#else
void _SPIAPI_SetPDMAChannelPara(u32 PDMA_CHn , u32* Para)
{
  *Para = PDMA_CHn;
}
#endif
#endif

