renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/spi_module.c
void _SPIAPI_InitAPIParameter(void)
{
  #ifdef HTCFG_SPI_CH0
  gSPIAPIState[SPI_API_CH0].pSPIx = _SPI_CH0;
  gSPIAPIState[SPI_API_CH0].pGPIO_MISO = _GPIO_MISO0;
  gSPIAPIState[SPI_API_CH0].uGPIO_MISOId =_MISO0_GPIO_ID;
  gSPIAPIState[SPI_API_CH0].uGPIO_MISOAfioPin =_MISO0_AFIO_PIN;
    #if SPICFG_PDMA_MODE
      #if SPICFG_CH0_PDMA_ENABLE
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH0_RX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH0].uPDMARxCh);
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH0_TX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH0].uPDMATxCh);
      #endif
    #endif
  #endif
  #ifdef HTCFG_SPI_CH1
  gSPIAPIState[SPI_API_CH1].pSPIx = _SPI_CH1;
  gSPIAPIState[SPI_API_CH1].pGPIO_MISO = _GPIO_MISO1;
  gSPIAPIState[SPI_API_CH1].uGPIO_MISOId =_MISO1_GPIO_ID;
  gSPIAPIState[SPI_API_CH1].uGPIO_MISOAfioPin =_MISO1_AFIO_PIN;
    #if SPICFG_PDMA_MODE
      #if SPICFG_CH1_PDMA_ENABLE
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH1_RX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH1].uPDMARxCh);
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH1_TX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH1].uPDMATxCh);
      #endif
    #endif
  #endif
  #ifdef HTCFG_SPI_CH2
  gSPIAPIState[SPI_API_CH2].pSPIx = _SPI_CH2;
  gSPIAPIState[SPI_API_CH2].pGPIO_MISO = _GPIO_MISO2;
  gSPIAPIState[SPI_API_CH2].uGPIO_MISOId =_MISO2_GPIO_ID;
  gSPIAPIState[SPI_API_CH2].uGPIO_MISOAfioPin =_MISO2_AFIO_PIN;
    #if SPICFG_PDMA_MODE
      #if SPICFG_CH2_PDMA_ENABLE
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH2_RX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH2].uPDMARxCh);
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH2_TX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH2].uPDMATxCh);
      #endif
    #endif
  #endif
  #ifdef HTCFG_SPI_CH3
  gSPIAPIState[SPI_API_CH3].pSPIx = _SPI_CH3;
  gSPIAPIState[SPI_API_CH3].pGPIO_MISO = _GPIO_MISO3;
  gSPIAPIState[SPI_API_CH3].uGPIO_MISOId =_MISO3_GPIO_ID;
  gSPIAPIState[SPI_API_CH3].uGPIO_MISOAfioPin =_MISO3_AFIO_PIN;
    #if SPICFG_PDMA_MODE
      #if SPICFG_CH3_PDMA_ENABLE
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH3_RX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH3].uPDMARxCh);
      _SPIAPI_SetPDMAChannelPara(SPI_API_CH3_TX_PDMA_CHANNEL, &gSPIAPIState[SPI_API_CH3].uPDMATxCh);
      #endif
    #endif
  #endif
}

#if FREERTOS_SPI
void SPIAPI_Init_FreeRTOS(u32 CH)
{
  taskENTER_CRITICAL();
  SPIAPI_Init(CH);
  Semphr[CH] = xSemaphoreCreateBinaryStatic(&Semphr_Buffer[CH]);
  Mutex[CH] = xSemaphoreCreateMutexStatic(&Mutex_Buffer[CH]);
  taskEXIT_CRITICAL();
}

u32 SPIAPI_WriteRead_FreeRTOS(u32 CH, SPIAPI_BufferTypeDef *pSPIAPIBuffer, u32 Timeout)
{
  TimeOut_t Tick_Base;

  vTaskSetTimeOutState(&Tick_Base);

  if(xSemaphoreTake(Mutex[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  taskENTER_CRITICAL();
  SPIAPI_ClearStatus(CH);
  SPIAPI_WriteRead(CH, pSPIAPIBuffer);
  xSemaphoreTake(Semphr[CH], 0);
  taskEXIT_CRITICAL();

  if(xTaskCheckForTimeOut(&Tick_Base, &Timeout) != pdFALSE)
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  if(xSemaphoreTake(Semphr[CH], Timeout) == pdFALSE)
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  xSemaphoreGive(Mutex[CH]);

  return Transfer_Result[CH];
}

void _SPIAPI_ISR_FreeRTOS(u32 CH)
{
  Transfer_Result[CH] = (SPIAPI_GetStatus(CH) == SPI_API_FINISH);
  if(SPIAPI_GetStatus(CH) == SPI_API_FINISH)
  {
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }
}

#endif

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
